ppp_log.md

# Table of Contents

1.  [About](#org35b09c3)
2.  [Dati di interesse](#orgde90a02)
    1.  [Orario delle lezioni](#org2895597)
        1.  [Desktop/Laptop](#org829d30c)
        2.  [Mobile/iPad](#org280a061)
3.  [Struttura sito](#orgcc4bb7b)



<a id="org35b09c3"></a>

# About

Questo file conterrà una serie di informazioni riguardanti il `pink peach
  project`.


<a id="orgde90a02"></a>

# Dati di interesse

Il sito dovrà fornire almeno le seguenti informazioni

-   **orario delle lezioni**.
-   **date esami**.
-   **contatti professori**.
-   **lista dei corsi**.
-   **informazioni dettagliate per ciascun corso**

A seguire riportiamo una breve discussione su come queste
informazioni devono essere mostrate.


<a id="org2895597"></a>

## Orario delle lezioni

L'orario delle lezioni sarà mostrato in due formati diversi in modo
da garantire la responsiveness del sito.


<a id="org829d30c"></a>

### Desktop/Laptop

Per i dispositivi tradizionali **desktop** (e **laptop**), l'orario verrà
mostrato con una semplice tabella una volta che l'utente ha scelto
il corso di laurea (tra **triennale** e **magistrale**), e l'anno di
interesse.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right"><b>Ora</b></th>
<th scope="col" class="org-left"><b>Lunedì</b></th>
<th scope="col" class="org-left"><b>Martedì</b></th>
<th scope="col" class="org-left"><b>Mercoledì</b></th>
<th scope="col" class="org-left"><b>Giovedì</b></th>
<th scope="col" class="org-left"><b>Venerdì</b></th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">09:00</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">10:00</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">11:00</td>
<td class="org-left">Geometria ed Algebra</td>
<td class="org-left">Fisica</td>
<td class="org-left">Geometria ed Algebra</td>
<td class="org-left">Fisica</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">12:00</td>
<td class="org-left">Geometria ed Algebra</td>
<td class="org-left">Fisica</td>
<td class="org-left">Geometria ed Algebra</td>
<td class="org-left">Fisica</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">13:00</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">14:00</td>
<td class="org-left">Logica e reti logiche</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Programmazione</td>
<td class="org-left">Logica e reti logiche</td>
<td class="org-left">Programmazione</td>
</tr>


<tr>
<td class="org-right">15:00</td>
<td class="org-left">Logica e reti logiche</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Programmazione</td>
<td class="org-left">Logica e reti logiche</td>
<td class="org-left">Programmazione</td>
</tr>


<tr>
<td class="org-right">16:00</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Programmazione</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Programmazione</td>
</tr>


<tr>
<td class="org-right">17:00</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">18:00</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<a id="org280a061"></a>

### Mobile/iPad

Quando invece abbiamo a che fare con dispositivi di una larghezza
più limitata l'idea è quella di spezzare l'orario in due tabelle:

-   Quella contenente gli **orari della mattina**
    
    <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
    
    
    <colgroup>
    <col  class="org-right" />
    
    <col  class="org-left" />
    
    <col  class="org-left" />
    
    <col  class="org-left" />
    
    <col  class="org-left" />
    
    <col  class="org-left" />
    </colgroup>
    <thead>
    <tr>
    <th scope="col" class="org-right"><b>Ora</b></th>
    <th scope="col" class="org-left"><b>Lunedì</b></th>
    <th scope="col" class="org-left"><b>Martedì</b></th>
    <th scope="col" class="org-left"><b>Mercoledì</b></th>
    <th scope="col" class="org-left"><b>Giovedì</b></th>
    <th scope="col" class="org-left"><b>Venerdì</b></th>
    </tr>
    </thead>
    
    <tbody>
    <tr>
    <td class="org-right">09:00</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    </tr>
    
    
    <tr>
    <td class="org-right">10:00</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    </tr>
    
    
    <tr>
    <td class="org-right">11:00</td>
    <td class="org-left">Geometria ed Algebra</td>
    <td class="org-left">Fisica</td>
    <td class="org-left">Geometria ed Algebra</td>
    <td class="org-left">Fisica</td>
    <td class="org-left">&#xa0;</td>
    </tr>
    
    
    <tr>
    <td class="org-right">12:00</td>
    <td class="org-left">Geometria ed Algebra</td>
    <td class="org-left">Fisica</td>
    <td class="org-left">Geometria ed Algebra</td>
    <td class="org-left">Fisica</td>
    <td class="org-left">&#xa0;</td>
    </tr>
    
    
    <tr>
    <td class="org-right">13:00</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    </tr>
    </tbody>
    </table>

-   E quella contenente gli **orari del pomeriggio**
    
    <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
    
    
    <colgroup>
    <col  class="org-right" />
    
    <col  class="org-left" />
    
    <col  class="org-left" />
    
    <col  class="org-left" />
    
    <col  class="org-left" />
    
    <col  class="org-left" />
    </colgroup>
    <thead>
    <tr>
    <th scope="col" class="org-right"><b>Ora</b></th>
    <th scope="col" class="org-left"><b>Lunedì</b></th>
    <th scope="col" class="org-left"><b>Martedì</b></th>
    <th scope="col" class="org-left"><b>Mercoledì</b></th>
    <th scope="col" class="org-left"><b>Giovedì</b></th>
    <th scope="col" class="org-left"><b>Venerdì</b></th>
    </tr>
    </thead>
    
    <tbody>
    <tr>
    <td class="org-right">14:00</td>
    <td class="org-left">Logica e reti logiche</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">Programmazione</td>
    <td class="org-left">Logica e reti logiche</td>
    <td class="org-left">Programmazione</td>
    </tr>
    
    
    <tr>
    <td class="org-right">15:00</td>
    <td class="org-left">Logica e reti logiche</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">Programmazione</td>
    <td class="org-left">Logica e reti logiche</td>
    <td class="org-left">Programmazione</td>
    </tr>
    
    
    <tr>
    <td class="org-right">16:00</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">Programmazione</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">Programmazione</td>
    </tr>
    
    
    <tr>
    <td class="org-right">17:00</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    </tr>
    
    
    <tr>
    <td class="org-right">18:00</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    <td class="org-left">&#xa0;</td>
    </tr>
    </tbody>
    </table>


<a id="orgcc4bb7b"></a>

# Struttura sito

L'idea è quella di scaricare tramite del web-scraping dal sito
ufficiale di informatica (<http://www.informatica.uniroma2.it/>) le
informazioni di interesse, metterle in una cartella, e
successivamente utilizzare un secondo python script per generare, a
partire dai dati scaricati, le pagine html/css/javascript necessarie
per costruire il nuovo sito.

Così facendo abbiamo un sito statico che viene ri-generato in modo
dinamico ogni tot. di tempo.

Per quanto riguarda la scaricazione delle informazioni dal sito di
informatica, è possibile utilizzare lo scraper al seguente URL:
[TorVergataCSWebAPI](https://github.com/LeonardoE95/TorVergataCSWebAPI.git), che dovrà essere integrati nella repository
corrente a breve.

